CS-3364/notes/html_output/2 - Basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-22 Wed 14:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Kieran Lavato" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7d9f223">0.1. DEFINE ALGORITHMS</a>
<ul>
<li><a href="#org3ed36d9">0.1.1. CHARACTERISTICS of ALGORITHMS</a></li>
<li><a href="#org9220721">0.1.2. EXAMPLE ALGORITHM TO MAKE A PEANUT BUTTER AND JELLY SANDWITCH:</a></li>
<li><a href="#org9703d45">0.1.3. WRITE AN ALGORITHM TO SWAP 2 NUMBERS:</a></li>
<li><a href="#org9394f78">0.1.4. ALGORITHM FOR FREQUENCY COUNT METHOD:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0cdbf9b">1. NEXT CLASS:</a></div>
</div>
<div id="outline-container-org7d9f223" class="outline-3">
<h3 id="org7d9f223"><span class="section-number-3">0.1.</span> DEFINE ALGORITHMS</h3>
<div class="outline-text-3" id="text-0-1">
<p>
An algorithm is a step-by-step procedure to solve a computationally-hard problem.
</p>

<p>
The differences between algorithms are the following:
</p>
<ul class="org-ul">
<li><b>Algorithms</b> are made in the design phase.</li>
<li><b>Programs</b> convert the design into a working implementation.</li>
</ul>

<p>
The initial phase of any product you try to develop is the <b>design</b> phase of a product. The algorithm-designing part is part of the initial phase. Programming, however, is created after the algorithm is made.
</p>

<p>
The person that writes the algorithms requires <b>domain knowledge.</b>
</p>
<ul class="org-ul">
<li>Can be written in ANY language</li>
<li>Chinese, English, German, etc.</li>
</ul>

<p>
The programmer may or may not have <b>domain knowledge.</b>
</p>
<ul class="org-ul">
<li>Needs a programming language to achieve the end result.</li>
<li>Java, C, C++, Rust, Python&#x2026;</li>
</ul>

<p>
An algorithm is independent from the hardware and software running on the computer. It isn&rsquo;t specific.
</p>
<ul class="org-ul">
<li>MacOS, Windows, Linux, etc.</li>
<li>RISC-V, x86<sub>64</sub>, ARM, etc.</li>
<li>Requires prior analysis.</li>
</ul>

<p>
The program is dependent on the hardware and software running on the computer.
</p>
<ul class="org-ul">
<li>x86<sub>64</sub> + Linux + GCC</li>
<li>ARM + MacOS + Clang</li>
<li>RISC-V + BSD + GCC</li>
<li>Requires constant testing.</li>
</ul>
</div>
<div id="outline-container-org3ed36d9" class="outline-4">
<h4 id="org3ed36d9"><span class="section-number-4">0.1.1.</span> CHARACTERISTICS of ALGORITHMS</h4>
<div class="outline-text-4" id="text-0-1-1">
<p>
<b>Input</b>:
</p>
<ul class="org-ul">
<li>Algorithm takes an input.</li>
</ul>

<p>
<b>Output</b>:
</p>
<ul class="org-ul">
<li>Must generate at least one output.</li>
</ul>

<p>
<b>Definiteness</b>:
</p>
<ul class="org-ul">
<li>Every line of the algorithm must be unambiguous.</li>
<li>You cannot just write \(\sqrt{-1}\). You must explain it.</li>
</ul>

<p>
<b>Finiteness</b>:
</p>
<ul class="org-ul">
<li>Algorithm should be finite and stop at some point.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org58a296f"></a>Important things to keep in mind:<br />
<div class="outline-text-5" id="text-0-1-1-1">
<p>
<b>Time</b>:
</p>
<ul class="org-ul">
<li>Time function</li>
</ul>

<p>
<b>Space</b>:
</p>
<ul class="org-ul">
<li>Memory space the program is taking up.</li>
</ul>

<p>
<b>Network Consumption</b>
</p>

<p>
<b>Power Consumption</b>
</p>

<p>
<b>CPU Registers Consumption</b>
</p>

<p>
<b><b>in terms of this class, we will only be talking about time and space.</b></b>
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org9220721" class="outline-4">
<h4 id="org9220721"><span class="section-number-4">0.1.2.</span> EXAMPLE ALGORITHM TO MAKE A PEANUT BUTTER AND JELLY SANDWITCH:</h4>
<div class="outline-text-4" id="text-0-1-2">
<p>
Ingredients/Inputs:
</p>
<ul class="org-ul">
<li>2 Slices of white, american &ldquo;loaf&rdquo; bread</li>
<li>1 jar/container of Strawberry Jelly</li>
<li>1 jar/container of Crunchy Peanut Butter</li>
<li>1 standard butter knife</li>
</ul>

<p>
Algorithm:
</p>
<ul class="org-ul">
<li>First, take one slice of bread. Put it on the table.</li>
<li>Second, on top of the bread, apply around a tablespoon of peanut butter on a single side of the bread. Ensure the side you apply it on does not touch the table.</li>
<li>Third, take another slice of bread. Put it beside the other slice of bread, but do not allow them to touch.</li>
<li>On the new piece of bread, apply a tablespoon of Strawberry jelly.</li>
<li>&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org9703d45" class="outline-4">
<h4 id="org9703d45"><span class="section-number-4">0.1.3.</span> WRITE AN ALGORITHM TO SWAP 2 NUMBERS:</h4>
<div class="outline-text-4" id="text-0-1-3">
<p>
Variables:
</p>
<ul class="org-ul">
<li>Variable &ldquo;A&rdquo;</li>
<li>Variable &ldquo;B&rdquo;</li>
<li>Unknown Variable &ldquo;C&rdquo;</li>
</ul>

<pre class="example" id="org2fe71fe">
BEGIN:
{
     C &lt;- A;
     A &lt;- B;
     B &lt;- C;
}

$f(n) = 1 + 1 + 1 = 3$
</pre>
</div>
</div>
<div id="outline-container-org9394f78" class="outline-4">
<h4 id="org9394f78"><span class="section-number-4">0.1.4.</span> ALGORITHM FOR FREQUENCY COUNT METHOD:</h4>
<div class="outline-text-4" id="text-0-1-4">
<pre class="example" id="orge6f69a7">
Algo Sum(A,n)
{
        s = 0;
        for(i = 0; i &lt; n; i++)
        {
                s = s + A[i]
        }
}
</pre>

<p>
where:
\begin{matrix}
        \text{A} &amp; 8 &amp; 3 &amp; 1 &amp; 4 &amp; 5<br />
        \text{ } &amp; 0 &amp; 1 &amp; 2 &amp; 3 &amp; 4
\end{matrix
</p>

<p>
Space:
</p>
<ul class="org-ul">
<li>A -&gt; n elements</li>
<li>i -&gt; 1</li>
<li>s -&gt; 1</li>
<li>n -&gt; 1</li>
</ul>

<p>
S(n) = n+3
O(n)
</p>
</div>
</div>
</div>
<div id="outline-container-org0cdbf9b" class="outline-2">
<h2 id="org0cdbf9b"><span class="section-number-2">1.</span> NEXT CLASS:</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Write an algorithm to add 2 matricies.</li>
<li>Write an algorithm to multiply 2 matricies.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kieran Lavato</p>
<p class="date">Created: 2025-01-22 Wed 14:43</p>
</div>
</body>
</html>
